#                                        Задание 1
#def power(base, exp):

#    if (exp == 1):

#        return (base)

#    if (exp != 1):

#        return (base * power(base, exp - 1))

#base = int(input("Введите число: "))

#exp = int(input("Введите его степень: "))

#print("Результат возведения в степень равен:", power(base, exp))
#_______________________________________________________________________________________________________

#                                        Задание 2
#a = int(input())
#b = int(input())
 
 
#def sum(a, b):
#    if b == 0:
#        return a
#    return sum(a+1, b-1)
 
 
#print(sum(a, b))
#________________________________________________________________________________________________________
